content/posts/hypertext_writing.md
+++
title = "Hypertext Writing"
author = ["Daniel Biasiotto"]
date = 2021-12-23T01:13:00+01:00
tags = ["article"]
draft = false
+++

-   Source: <https://www.dschapman.com/articles/hypertext-writing>
-   Author: [D.S. Chapman]({{< relref "d_s_chapman.md" >}})
-   Related: [Hypertext]({{< relref "20211218213408-hypertext.md" >}}), [Zettelkasten]({{< relref "20200528213816-zettelkasten.md" >}})


## The Good {#the-good}

-   context throught side by side content: [marginalia]({{< relref "marginalia.md" >}})
    -   always been the power of the written word
-   here comes the Intenet with bidirectional links
    -   closer to out brain convolutedness


## The Less Good {#the-less-good}

-   link are distracting
    -   a flood of links is cumbersome on the eyes
    -   but they are _great_ for note-taking and expanding on ideas
    -   for someone tryng to follow a logical thread the links get confusing quickly
        -   <span class="underline">links are rabbitholes</span> the reader might never emerge from
-   [Project Xanadu]({{< relref "20211218213307-project_xanadu.md" >}}) is cool and all but results in pretty but confusing lines[^fn:1]


## Dilution of Meaning {#dilution-of-meaning}

-   links water down meaning
    -   in linking you are hiding behind someone else'sh writing[^fn:2]

[^fn:1]: right but hypertext is a great tool, it has to be used with purpose
[^fn:2]: _write better_, if you can't then link somewhere
